In [6]:
import pandas as pd
import numpy as np

In [7]:
mainpath = r'/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/'
filename = r'vehicles.csv'
fullpath = mainpath+filename
data = pd.read_csv(fullpath)
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [9]:
print(pd.__version__)
print(np.__version__)

1.2.3
1.20.1

In [10]:
serie = pd.Series(np.random.randint(100,size=10))
print(serie)

0    38
1    39
2     3
3    81
4    62
5    55
6     2
7     7
8    12
9    50
dtype: int32

In [12]:
serie[3]

81

In [14]:
df = pd.DataFrame(np.random.randint(100, size=[10,4]))
df

    0   1   2   3
0  32   3  66  75
1  65  56  71  44
2  44  25  18  81
3  37  51  69  34
4  92  44  94  85
5  47  56  90  96
6  19  25  58   7
7  89  17  63  34
8  35  58   3  55
9  35  24  71  81

In [15]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [16]:
df[0]

0    32
1    65
2    44
3    37
4    92
5    47
6    19
7    89
8    35
9    35
Name: 0, dtype: int32

In [18]:
df = df.rename(columns = {0:"columna_1", 1:"columna_2", 2:"columna_3", 3:"columna_4"})
df

   columna_1  columna_2  columna_3  columna_4
0         32          3         66         75
1         65         56         71         44
2         44         25         18         81
3         37         51         69         34
4         92         44         94         85
5         47         56         90         96
6         19         25         58          7
7         89         17         63         34
8         35         58          3         55
9         35         24         71         81

In [19]:
df.columns = ["A","B","C","D"]
df

    A   B   C   D
0  32   3  66  75
1  65  56  71  44
2  44  25  18  81
3  37  51  69  34
4  92  44  94  85
5  47  56  90  96
6  19  25  58   7
7  89  17  63  34
8  35  58   3  55
9  35  24  71  81

In [21]:
# los nuevos nombres se asignan a u nuevo df
df = df.rename(columns = {"A":"columna_1", "B":"columna_2", "C":"columna_3", "D":"columna_4"})
df

   columna_1  columna_2  columna_3  columna_4
0         32          3         66         75
1         65         56         71         44
2         44         25         18         81
3         37         51         69         34
4         92         44         94         85
5         47         56         90         96
6         19         25         58          7
7         89         17         63         34
8         35         58          3         55
9         35         24         71         81

In [23]:
# inplace sirve para hacer el cambio sin asignarloa un nuevo df
df.rename(columns = {"A":"columna_1", "B":"columna_2", "C":"columna_3", "D":"columna_4"}, inplace=True)
df

   columna_1  columna_2  columna_3  columna_4
0         32          3         66         75
1         65         56         71         44
2         44         25         18         81
3         37         51         69         34
4         92         44         94         85
5         47         56         90         96
6         19         25         58          7
7         89         17         63         34
8         35         58          3         55
9         35         24         71         81

In [24]:
df["columna_1"]

0    32
1    65
2    44
3    37
4    92
5    47
6    19
7    89
8    35
9    35
Name: columna_1, dtype: int32

In [33]:
df_subset = df[["columna_4","columna_3","columna_2"]]
df_subset

   columna_4  columna_3  columna_2
0         75         66          3
1         44         71         56
2         81         18         25
3         34         69         51
4         85         94         44
5         96         90         56
6          7         58         25
7         34         63         17
8         55          3         58
9         81         71         24

In [34]:
df_subset.set_index(keys="columna_4", inplace=True)
df_subset

           columna_3  columna_2
columna_4
75                66          3
44                71         56
81                18         25
34                69         51
85                94         44
96                90         56
7                 58         25
34                63         17
55                 3         58
81                71         24

In [35]:
df_subset.head(5)

           columna_3  columna_2
columna_4
75                66          3
44                71         56
81                18         25
34                69         51
85                94         44

In [36]:
df_subset["columna_3"]

columna_4
75    66
44    71
81    18
34    69
85    94
96    90
7     58
34    63
55     3
81    71
Name: columna_3, dtype: int32

In [46]:
company = ["Apple", "Citigroup", "General_Electric", 
          "Pfizer", "Boing_Co", "AT&t", "Ford"]
price = [119.04, 43.19, 7.29, 37.95, 167.35, 27.33, 7.67]

df = pd.DataFrame(price, columns=["Stock_price"])
df

   Stock_price
0       119.04
1        43.19
2         7.29
3        37.95
4       167.35
5        27.33
6         7.67

In [37]:
lista_de_listas = [np.random.random(10) for i in range(4)]
lista_de_listas

[array([0.26908048, 0.2116987 , 0.77484236, 0.69457172, 0.54626841,
        0.5345544 , 0.25817756, 0.55463614, 0.4628496 , 0.22794325]),
 array([0.52332399, 0.15193861, 0.04905273, 0.62322571, 0.67942465,
        0.35413168, 0.34161692, 0.01175337, 0.47400491, 0.26862209]),
 array([0.27776556, 0.99495547, 0.2609615 , 0.67665792, 0.32092977,
        0.87300173, 0.96440936, 0.8375854 , 0.39230258, 0.0241579 ]),
 array([0.51729089, 0.87857294, 0.33475445, 0.07811764, 0.6329945 ,
        0.50411893, 0.64136808, 0.70433798, 0.30813732, 0.11942684])]

In [42]:
nombre_de_columna = [f"columna{i}" for i in range(len(lista_de_listas[0]))]
print(nombre_de_columna)

['columna0', 'columna1', 'columna2', 'columna3', 'columna4', 'columna5', 'columna6', 'columna7', 'columna8', 'columna9']

In [50]:
df = pd.DataFrame(lista_de_listas, columns = nombre_de_columna)
df

,columna0,columna1,columna2,columna3,columna4,columna5,columna6,columna7,columna8,columna9
0,0.269080,0.211699,0.774842,0.694572,0.546268,0.534554,0.258178,0.554636,0.462850,0.227943
1,0.523324,0.151939,0.049053,0.623226,0.679425,0.354132,0.341617,0.011753,0.474005,0.268622
2,0.277766,0.994955,0.260961,0.676658,0.320930,0.873002,0.964409,0.837585,0.392303,0.024158
3,0.517291,0.878573,0.334754,0.078118,0.632995,0.504119,0.641368,0.704338,0.308137,0.119427

In [51]:
df = df.transpose()
df

                 0         1         2         3
columna0  0.269080  0.523324  0.277766  0.517291
columna1  0.211699  0.151939  0.994955  0.878573
columna2  0.774842  0.049053  0.260961  0.334754
columna3  0.694572  0.623226  0.676658  0.078118
columna4  0.546268  0.679425  0.320930  0.632995
columna5  0.534554  0.354132  0.873002  0.504119
columna6  0.258178  0.341617  0.964409  0.641368
columna7  0.554636  0.011753  0.837585  0.704338
columna8  0.462850  0.474005  0.392303  0.308137
columna9  0.227943  0.268622  0.024158  0.119427

In [52]:
df.reset_index(drop=True)

          0         1         2         3
0  0.269080  0.523324  0.277766  0.517291
1  0.211699  0.151939  0.994955  0.878573
2  0.774842  0.049053  0.260961  0.334754
3  0.694572  0.623226  0.676658  0.078118
4  0.546268  0.679425  0.320930  0.632995
5  0.534554  0.354132  0.873002  0.504119
6  0.258178  0.341617  0.964409  0.641368
7  0.554636  0.011753  0.837585  0.704338
8  0.462850  0.474005  0.392303  0.308137
9  0.227943  0.268622  0.024158  0.119427

In [53]:
df.reset_index(drop=False)

      index         0         1         2         3
0  columna0  0.269080  0.523324  0.277766  0.517291
1  columna1  0.211699  0.151939  0.994955  0.878573
2  columna2  0.774842  0.049053  0.260961  0.334754
3  columna3  0.694572  0.623226  0.676658  0.078118
4  columna4  0.546268  0.679425  0.320930  0.632995
5  columna5  0.534554  0.354132  0.873002  0.504119
6  columna6  0.258178  0.341617  0.964409  0.641368
7  columna7  0.554636  0.011753  0.837585  0.704338
8  columna8  0.462850  0.474005  0.392303  0.308137
9  columna9  0.227943  0.268622  0.024158  0.119427

In [54]:
materiales = {"4135001": [1373.875, 134.075, 32.25],
             "4135002": [1400, 136.6, 40.666],
             "4135003": [1920.25, 188.25, 80.25], 
             "4135004": [1881.2, 184.38, 81]}

In [55]:
df = pd.DataFrame(materiales)
df

    4135001   4135002  4135003  4135004
0  1373.875  1400.000  1920.25  1881.20
1   134.075   136.600   188.25   184.38
2    32.250    40.666    80.25    81.00

In [56]:
df_transpose = df.transpose()
df_transpose

                0        1       2
4135001  1373.875  134.075  32.250
4135002  1400.000  136.600  40.666
4135003  1920.250  188.250  80.250
4135004  1881.200  184.380  81.000

In [59]:
df_transpose.reset_index(drop=False, inplace=True)

In [62]:
column_name = ["ID_company","net_sales","sales","quantity"]
df_transpose. columns = column_name
df_transpose

  ID_company  net_sales    sales  quantity
0    4135001   1373.875  134.075    32.250
1    4135002   1400.000  136.600    40.666
2    4135003   1920.250  188.250    80.250
3    4135004   1881.200  184.380    81.000

In [63]:
df_transpose['net_sales'].sum()

6575.325

In [65]:
df_transpose['quantity'].mean()

58.5415

In [67]:
df_transpose['quantity'].max()

81.0

In [68]:
df_transpose['quantity'].min()

32.25

In [69]:
df_transpose.describe()

         net_sales       sales   quantity
count     4.000000    4.000000   4.000000
mean   1643.831250  160.826250  58.541500
std     297.254831   29.492269  25.732079
min    1373.875000  134.075000  32.250000
25%    1393.468750  135.968750  38.562000
50%    1640.600000  160.490000  60.458000
75%    1890.962500  185.347500  80.437500
max    1920.250000  188.250000  81.000000

In [70]:
df_transpose["columna_nueva"] = df_transpose["net_sales"]*df_transpose["quantity"]
df_transpose

  ID_company  net_sales    sales  quantity  columna_nueva
0    4135001   1373.875  134.075    32.250    44307.46875
1    4135002   1400.000  136.600    40.666    56932.40000
2    4135003   1920.250  188.250    80.250   154100.06250
3    4135004   1881.200  184.380    81.000   152377.20000

In [71]:
mainpath = r'/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/'
filename = r'vehicles.csv'
fullpath = mainpath+filename
data = pd.read_csv(fullpath)
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [74]:
print(os.getcwd())
print(os.listdir(os.getcwd()))

c:\Users\lgutierrez\Documents\Desarrollo\iron-hack\module-1\12-pandas-numpy
['datasets', 'intro-numpy.ipynb', 'pandas-numpy.ipynb', 'pandas-numpy.py', 'pandas.ipynb']

In [79]:
data = pd.read_csv("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles.csv")
data.head(10)

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
5,Acura,2.2CL/3.0CL,1997,2.2,4.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,20,26,22,403.954545,1500
6,Acura,2.2CL/3.0CL,1997,2.2,4.0,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,22,28,24,370.291667,1400
7,Acura,2.2CL/3.0CL,1997,3.0,6.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,16.480500,18,26,20,444.350000,1650
8,Acura,2.3CL/3.0CL,1998,2.3,4.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,19,27,22,403.954545,1500
9,Acura,2.3CL/3.0CL,1998,2.3,4.0,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,21,29,24,370.291667,1400

In [76]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35952 entries, 0 to 35951
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Make                     35952 non-null  object
 1   Model                    35952 non-null  object
 2   Year                     35952 non-null  int64
 3   Engine Displacement      35952 non-null  float64
 4   Cylinders                35952 non-null  float64
 5   Transmission             35952 non-null  object
 6   Drivetrain               35952 non-null  object
 7   Vehicle Class            35952 non-null  object
 8   Fuel Type                35952 non-null  object
 9   Fuel Barrels/Year        35952 non-null  float64
 10  City MPG                 35952 non-null  int64
 11  Highway MPG              35952 non-null  int64
 12  Combined MPG             35952 non-null  int64
 13  CO2 Emission Grams/Mile  35952 non-null  float64
 14  Fuel Cost/Year           35952 non-null  int64
dtypes: float64(4), int64(5), object(6)
memory usage: 4.1+ MB

In [82]:
# limitación en carga de registros
data = pd.read_csv("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles.csv",
                  dtype={"Model":str,"Year":np.int32},
                  nrows= 10000,
                  usecols= ["Model","Year","Transmission"]
                  )
data.head(10)

                 Model  Year     Transmission
0    DJ Po Vehicle 2WD  1984  Automatic 3-spd
1     FJ8c Post Office  1984  Automatic 3-spd
2  Post Office DJ5 2WD  1985  Automatic 3-spd
3  Post Office DJ8 2WD  1985  Automatic 3-spd
4                  GNX  1987  Automatic 4-spd
5          2.2CL/3.0CL  1997  Automatic 4-spd
6          2.2CL/3.0CL  1997     Manual 5-spd
7          2.2CL/3.0CL  1997  Automatic 4-spd
8          2.3CL/3.0CL  1998  Automatic 4-spd
9          2.3CL/3.0CL  1998     Manual 5-spd

In [83]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Model         10000 non-null  object
 1   Year          10000 non-null  int32
 2   Transmission  10000 non-null  object
dtypes: int32(1), object(2)
memory usage: 195.4+ KB

In [84]:
data.tail(10)

        Model  Year     Transmission
9990  Daytona  1987  Automatic 3-spd
9991  Daytona  1987     Manual 5-spd
9992  Daytona  1988  Automatic 3-spd
9993  Daytona  1988     Manual 5-spd
9994  Daytona  1988  Automatic 3-spd
9995  Daytona  1988     Manual 5-spd
9996  Daytona  1989     Manual 5-spd
9997  Daytona  1989  Automatic 3-spd
9998  Daytona  1989  Automatic 3-spd
9999  Daytona  1989     Manual 5-spd

In [86]:
data = pd.read_csv("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles_pipe.txt", sep="|")
data.head(10)

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
5,Acura,2.2CL/3.0CL,1997,2.2,4.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,20,26,22,403.954545,1500
6,Acura,2.2CL/3.0CL,1997,2.2,4.0,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,22,28,24,370.291667,1400
7,Acura,2.2CL/3.0CL,1997,3.0,6.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,16.480500,18,26,20,444.350000,1650
8,Acura,2.3CL/3.0CL,1998,2.3,4.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,19,27,22,403.954545,1500
9,Acura,2.3CL/3.0CL,1998,2.3,4.0,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,21,29,24,370.291667,1400

In [87]:
data = pd.read_csv("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles_tab.txt", sep="\t")
data.head(10)

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
5,Acura,2.2CL/3.0CL,1997,2.2,4.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,20,26,22,403.954545,1500
6,Acura,2.2CL/3.0CL,1997,2.2,4.0,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,22,28,24,370.291667,1400
7,Acura,2.2CL/3.0CL,1997,3.0,6.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,16.480500,18,26,20,444.350000,1650
8,Acura,2.3CL/3.0CL,1998,2.3,4.0,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,19,27,22,403.954545,1500
9,Acura,2.3CL/3.0CL,1998,2.3,4.0,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,21,29,24,370.291667,1400

In [95]:
data = pd.read_excel("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles.xlsx")
data.head(10)

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
5,Acura,2.2CL/3.0CL,1997,2.2,4,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,20,26,22,403.954545,1500
6,Acura,2.2CL/3.0CL,1997,2.2,4,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,22,28,24,370.291667,1400
7,Acura,2.2CL/3.0CL,1997,3.0,6,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,16.480500,18,26,20,444.350000,1650
8,Acura,2.3CL/3.0CL,1998,2.3,4,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,19,27,22,403.954545,1500
9,Acura,2.3CL/3.0CL,1998,2.3,4,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,21,29,24,370.291667,1400

In [96]:
data = pd.read_json("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles.json")
data.head(10)

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
5,Acura,2.2CL/3.0CL,1997,2.2,4,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,20,26,22,403.954545,1500
6,Acura,2.2CL/3.0CL,1997,2.2,4,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,22,28,24,370.291667,1400
7,Acura,2.2CL/3.0CL,1997,3.0,6,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,16.480500,18,26,20,444.350000,1650
8,Acura,2.3CL/3.0CL,1998,2.3,4,Automatic 4-spd,Front-Wheel Drive,Subcompact Cars,Regular,14.982273,19,27,22,403.954545,1500
9,Acura,2.3CL/3.0CL,1998,2.3,4,Manual 5-spd,Front-Wheel Drive,Subcompact Cars,Regular,13.733750,21,29,24,370.291667,1400

In [97]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35952 entries, 0 to 35951
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Make                     35952 non-null  object
 1   Model                    35952 non-null  object
 2   Year                     35952 non-null  int64
 3   Engine Displacement      35952 non-null  float64
 4   Cylinders                35952 non-null  int64
 5   Transmission             35952 non-null  object
 6   Drivetrain               35952 non-null  object
 7   Vehicle Class            35952 non-null  object
 8   Fuel Type                35952 non-null  object
 9   Fuel Barrels/Year        35952 non-null  float64
 10  City MPG                 35952 non-null  int64
 11  Highway MPG              35952 non-null  int64
 12  Combined MPG             35952 non-null  int64
 13  CO2 Emission Grams/Mile  35952 non-null  float64
 14  Fuel Cost/Year           35952 non-null  int64
dtypes: float64(3), int64(6), object(6)
memory usage: 4.1+ MB

In [98]:
data._get_numeric_data()

,Year,Engine Displacement,Cylinders,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,1984,2.5,4,19.388824,18,17,17,522.764706,1950
1,1984,4.2,6,25.354615,13,13,13,683.615385,2550
2,1985,2.5,4,20.600625,16,17,16,555.437500,2100
3,1985,4.2,6,25.354615,13,13,13,683.615385,2550
4,1987,3.8,6,20.600625,14,21,16,555.437500,2550
...,...,...,...,...,...,...,...,...,...
35947,2013,1.0,3,9.155833,34,38,36,244.000000,1100
35948,2014,1.0,3,9.155833,34,38,36,243.000000,1100
35949,2015,1.0,3,9.155833,34,38,36,244.000000,1100
35950,2016,0.9,3,9.155833,34,39,36,246.000000,1100
35951,2016,0.9,3,9.417429,32,39,35,255.000000,1150

In [99]:
data.to_csv("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles_lucio.csv")

In [100]:
data.to_excel("c:/Users/lgutierrez/Documents/Desarrollo/iron-hack/module-1/12-pandas-numpy/datasets/vehicles_lucio.xlsx")